grpc/drone-delivery-test-plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Drone Delivery App (gRPC) - Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Drone Delivery Sequence" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">200</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="Schedule delivery" enabled="true">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\josem\Desktop\MEI\2-year\tmdei\tmdei-drone-delivery-app\tmdei-drone-delivery-app-performance-tests\grpc\proto</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8081</stringProp>
          <stringProp name="GRPCSampler.fullMethod">schedulerservice.SchedulerService/scheduleDelivery</stringProp>
          <stringProp name="GRPCSampler.deadline">1000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">{
    &quot;dropOff_latitude&quot;: &quot;370017&quot;,
    &quot;dropOff_longitude&quot;: &quot;5&quot;,
    &quot;height&quot;: 207,
    &quot;pickup_latitude&quot;: &quot;08274881&quot;,
    &quot;pickup_longitude&quot;: &quot;88200&quot;,
    &quot;username&quot;: &quot;wjones&quot;,
    &quot;weight&quot;: 509,
    &quot;width&quot;: 204
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">package;transport;delivery </stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.package;$.drone;$.delivery</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">null;null;null</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Duration Assertion" enabled="true">
            <stringProp name="DurationAssertion.duration">600</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="Tag package" enabled="true">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\josem\Desktop\MEI\2-year\tmdei\tmdei-drone-delivery-app\tmdei-drone-delivery-app-performance-tests\grpc\proto</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8085</stringProp>
          <stringProp name="GRPCSampler.fullMethod">packagemanagement.PackageService/createTagForPackage</stringProp>
          <stringProp name="GRPCSampler.deadline">1000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">{
    &quot;package_id&quot;: &quot;${package}&quot;,
    &quot;tag&quot;: &quot;${__RandomString(10,abcdefghijklmnopqrstuvwxyz,)}&quot;
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Duration Assertion" enabled="true">
            <stringProp name="DurationAssertion.duration">600</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="Pickup package" enabled="true">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\josem\Desktop\MEI\2-year\tmdei\tmdei-drone-delivery-app\tmdei-drone-delivery-app-performance-tests\grpc\proto</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8081</stringProp>
          <stringProp name="GRPCSampler.fullMethod">schedulerservice.SchedulerService/pickupPackage</stringProp>
          <stringProp name="GRPCSampler.deadline">1000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;drone&quot;:&quot;${transport}&quot;
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Duration Assertion" enabled="true">
            <stringProp name="DurationAssertion.duration">600</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="Get ETA for delivery" enabled="true">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\josem\Desktop\MEI\2-year\tmdei\tmdei-drone-delivery-app\tmdei-drone-delivery-app-performance-tests\grpc\proto</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8081</stringProp>
          <stringProp name="GRPCSampler.fullMethod">schedulerservice.SchedulerService/getDeliveryEta</stringProp>
          <stringProp name="GRPCSampler.deadline">1000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">{
    &quot;delivery&quot;: &quot;${delivery}&quot;
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Duration Assertion" enabled="true">
            <stringProp name="DurationAssertion.duration">600</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="Complete delivery" enabled="true">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\josem\Desktop\MEI\2-year\tmdei\tmdei-drone-delivery-app\tmdei-drone-delivery-app-performance-tests\grpc\proto</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8081</stringProp>
          <stringProp name="GRPCSampler.fullMethod">schedulerservice.SchedulerService/completeDelivery</stringProp>
          <stringProp name="GRPCSampler.deadline">1000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">{
    &quot;delivery&quot;: &quot;${delivery}&quot;
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Duration Assertion" enabled="true">
            <stringProp name="DurationAssertion.duration">600</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="Confirm delivery" enabled="true">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\josem\Desktop\MEI\2-year\tmdei\tmdei-drone-delivery-app\tmdei-drone-delivery-app-performance-tests\grpc\proto</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8086</stringProp>
          <stringProp name="GRPCSampler.fullMethod">deliverymanagement.DeliveryService/confirmDelivery</stringProp>
          <stringProp name="GRPCSampler.deadline">1000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">{
    &quot;delivery&quot;: &quot;${delivery}&quot;,
    &quot;signature&quot;: &quot;${__RandomString(10,abcdefghijklmnopqrstuvwxyz,)}&quot;
}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Duration Assertion" enabled="true">
            <stringProp name="DurationAssertion.duration">600</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="Get deliveries by username" enabled="true">
          <stringProp name="GRPCSampler.protoFolder">C:\Users\josem\Desktop\MEI\2-year\tmdei\tmdei-drone-delivery-app\tmdei-drone-delivery-app-performance-tests\grpc\proto</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">8086</stringProp>
          <stringProp name="GRPCSampler.fullMethod">deliverymanagement.DeliveryService/listDeliveries</stringProp>
          <stringProp name="GRPCSampler.deadline">1000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <boolProp name="GRPCSampler.tlsDisableVerification">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;username&quot;: &quot;wjones&quot;
}
</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Duration Assertion" enabled="true">
            <stringProp name="DurationAssertion.duration">600</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>